src/Documents/ВыполнениеПроектов/ВыполнениеПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыполнениеПроектов</name>
  <registerRecords>InformationRegister.УП_ОбщиеСведенияПоПроектам</registerRecords>
  <registerRecords>AccumulationRegister.УП_РасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.УП_РасчетыСИсполнителями</registerRecords>
  <registerRecords>InformationRegister.СостоянияПроектов</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <registerRecords>InformationRegister.УП_СостоянияПроектов</registerRecords>
  <registerRecords>InformationRegister.УП_ИсполнителиПроектов_Факт</registerRecords>
  <registerRecords>InformationRegister.УП_СостоянияПроектовИсполнителей</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученАктОтЗаказчика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияАктаОтЗаказчика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗачестьПредоплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриПечатиКоличествоРавно1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроектПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Исполнители</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/УП_РасчетыСКонтрагентами/УП_РасчетыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УП_РасчетыСКонтрагентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>АналитикаУчетаПоКонтрагентам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоКонтрагентам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами/ВзаиморасчетыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКонтрагентами</name>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалютеУчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаУчета</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/СостоянияПроектов/СостоянияПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияПроектов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияПроектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/УП_СостоянияПроектов/УП_СостоянияПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УП_СостоянияПроектов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияПроектов</types>
    </type>
  </resources>
  <dimensions>
    <name>АналитикаУчетаПоКонтрагентам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоКонтрагентам</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/УП_ОбщиеСведенияПоПроектам/УП_ОбщиеСведенияПоПроектам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УП_ОбщиеСведенияПоПроектам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РуководительПроекта</name>
    <type>
      <types>CatalogRef.Исполнители</types>
    </type>
  </resources>
  <resources>
    <name>ВыполнитьДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПолученияАктаВыполненныхРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>АналитикаУчетаПоКонтрагентам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоКонтрагентам</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/УП_СтоимостьПроектов/УП_СтоимостьПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УП_СтоимостьПроектов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>АналитикаУчетаПоКонтрагентам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоКонтрагентам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/УП_ИсполнителиПроектов_Факт/УП_ИсполнителиПроектов_Факт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УП_ИсполнителиПроектов_Факт</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВремяВыполнения</name>
    <comment>(в минутах)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>АналитикаУчетаПоКонтрагентам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоКонтрагентам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Исполнители</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/УП_РасчетыСИсполнителями/УП_РасчетыСИсполнителями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УП_РасчетыСИсполнителями</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>АналитикаУчетаПоКонтрагентам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоКонтрагентам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Исполнители</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/УП_СостоянияПроектовИсполнителей/УП_СостоянияПроектовИсполнителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УП_СостоянияПроектовИсполнителей</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияПроектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Исполнители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаПоКонтрагентам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоКонтрагентам</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ВыполнениеПроектов/ObjectModule.bsl
//////////////////////////////////////////////////////////////////////////////////
//// РАЗДЕЛ ПРОЦЕДУР И ФУНКЦИЙ

Функция ПолучитьРезультатЗапросаПредоплаты(МоментВремени, Контрагент, Клиент, Проект) Экспорт
	
	// проверим на предоплату
	// сначала по проекту, потом по клиенту, потом по контрагенту
	Для i=1 По 3 Цикл
		ЗапросПредоплаты = Новый Запрос;
		Если i=1 Тогда
			// проект
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	УП_РасчетыСКонтрагентамиОстатки.АналитикаУчетаПоКонтрагентам,
			|	УП_РасчетыСКонтрагентамиОстатки.СуммаОстаток * -1 КАК Предоплата
			|ИЗ
			|	РегистрНакопления.УП_РасчетыСКонтрагентами.Остатки(
			|			&МоментВремени,
			|			АналитикаУчетаПоКонтрагентам.Контрагент = &Контрагент
			|				И АналитикаУчетаПоКонтрагентам.Клиент = &Клиент
			|				И АналитикаУчетаПоКонтрагентам.Проект = &Проект) КАК УП_РасчетыСКонтрагентамиОстатки";
		ИначеЕсли i=2 Тогда
			// клиент
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	УП_РасчетыСКонтрагентамиОстатки.АналитикаУчетаПоКонтрагентам,
			|	УП_РасчетыСКонтрагентамиОстатки.СуммаОстаток * -1 КАК Предоплата
			|ИЗ
			|	РегистрНакопления.УП_РасчетыСКонтрагентами.Остатки(
			|			&МоментВремени,
			|			АналитикаУчетаПоКонтрагентам.Контрагент = &Контрагент
			|				И АналитикаУчетаПоКонтрагентам.Клиент = &Клиент) КАК УП_РасчетыСКонтрагентамиОстатки";
		ИначеЕсли i=3 Тогда
			// контрагент
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	УП_РасчетыСКонтрагентамиОстатки.АналитикаУчетаПоКонтрагентам,
			|	УП_РасчетыСКонтрагентамиОстатки.СуммаОстаток * -1 КАК Предоплата
			|ИЗ
			|	РегистрНакопления.УП_РасчетыСКонтрагентами.Остатки(&МоментВремени, АналитикаУчетаПоКонтрагентам.Контрагент = &Контрагент) КАК УП_РасчетыСКонтрагентамиОстатки";
		КонецЕсли;
		ЗапросПредоплаты.Текст = ТекстЗапроса;
		ЗапросПредоплаты.УстановитьПараметр("МоментВремени", МоментВремени);
		ЗапросПредоплаты.УстановитьПараметр("Контрагент"   , Контрагент);
		ЗапросПредоплаты.УстановитьПараметр("Клиент"       , Клиент);
		ЗапросПредоплаты.УстановитьПараметр("Проект"       , Проект);
		РезультатЗапросаПредоплаты = ЗапросПредоплаты.Выполнить();
		Если НЕ РезультатЗапросаПредоплаты.Пустой() Тогда
			Возврат РезультатЗапросаПредоплаты;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

// Обработка проведения документа.
// ................................................................................
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движения.СостоянияПроектов.Записывать           = Истина;
	Движения.УП_РасчетыСКонтрагентами.Записывать    = Истина;
	Движения.УП_СостоянияПроектов.Записывать        = Истина;
	Движения.УП_ОбщиеСведенияПоПроектам.Записывать  = Истина;
	
	Для Каждого ТекСтрокаПроекты Из Проекты Цикл
		
		ПараметрыАналитики = Новый Структура();
		ПараметрыАналитики.Вставить("Контрагент", Контрагент);
		ПараметрыАналитики.Вставить("Клиент"    , ТекСтрокаПроекты.Клиент);
		ПараметрыАналитики.Вставить("Проект"    , ТекСтрокаПроекты.Проект);
		АналитикаУчетаПоКонтрагентам = УП_РаботаСДокументамиСервер.ЗначениеКлючаАналитики(ПараметрыАналитики);
		
		#Область ОбластьУстаревшегоКода
			Движение                      = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
			Движение.ВидДвижения          = ВидДвиженияНакопления.Приход;
			Движение.Период               = Дата;
			Движение.Контрагент           = Контрагент;
			Движение.ВалютаВзаиморасчетов = ТекСтрокаПроекты.Валюта;
			Движение.ВалютаУчета          = Константы.ВалютаУчета.Получить();
			Движение.Проект               = ТекСтрокаПроекты.Проект;
			Движение.СуммаВзаиморасчетов  = ТекСтрокаПроекты.Сумма;
			Движение.СуммаВВалютеУчета    = ТекСтрокаПроекты.Сумма*УП_ОбщегоНазначения_Сервер.ПолучитьАктуальныйКурсВалюты(Дата, ТекСтрокаПроекты.Валюта);
			
			Движение                   = Движения.СостоянияПроектов.Добавить();
			Движение.Период            = Дата;
			Движение.Контрагент        = Контрагент;
			Движение.Проект            = ТекСтрокаПроекты.Проект;
			Движение.Состояние         = Перечисления.СостоянияПроектов.Выполнен;
		#КонецОбласти
		
		Движение                              = Движения.УП_СостоянияПроектов.Добавить();
		Движение.Период                       = Дата;
		Движение.АналитикаУчетаПоКонтрагентам = АналитикаУчетаПоКонтрагентам;
		Движение.Состояние                    = Перечисления.СостоянияПроектов.Выполнен;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КлючиАналитикиУчетаПоКонтрагентам.Ссылка КАК АналитикаУчетаПоКонтрагентам,
		|	ЕСТЬNULL(УП_РасчетыСКонтрагентамиОстатки.СуммаОстаток, 0) КАК ДолгКонтрагента,
		|	ЕСТЬNULL(УП_СтоимостьПроектовСрезПоследних.Сумма, 0) КАК СтоимостьПроектаПоПлану,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УП_СтоимостьПроектовСрезПоследних.Сумма, 0) <> 0
		|			ТОГДА ВЫБОР
		|					КОГДА УП_СтоимостьПроектовСрезПоследних.Сумма <= ВЫБОР
		|							КОГДА ЕСТЬNULL(УП_РасчетыСКонтрагентамиОстатки.СуммаОстаток, 0) < 0
		|								ТОГДА ЕСТЬNULL(УП_РасчетыСКонтрагентамиОстатки.СуммаОстаток, 0) * -1
		|							ИНАЧЕ ЕСТЬNULL(УП_РасчетыСКонтрагентамиОстатки.СуммаОстаток, 0)
		|						КОНЕЦ
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОплаченПолностью
		|ИЗ
		|	Справочник.КлючиАналитикиУчетаПоКонтрагентам КАК КлючиАналитикиУчетаПоКонтрагентам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УП_РасчетыСКонтрагентами.Остатки(&Дата, АналитикаУчетаПоКонтрагентам = &АналитикаУчетаПоКонтрагентам) КАК УП_РасчетыСКонтрагентамиОстатки
		|		ПО КлючиАналитикиУчетаПоКонтрагентам.Ссылка = УП_РасчетыСКонтрагентамиОстатки.АналитикаУчетаПоКонтрагентам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УП_СтоимостьПроектов.СрезПоследних(&Дата, АналитикаУчетаПоКонтрагентам = &АналитикаУчетаПоКонтрагентам) КАК УП_СтоимостьПроектовСрезПоследних
		|		ПО КлючиАналитикиУчетаПоКонтрагентам.Ссылка = УП_СтоимостьПроектовСрезПоследних.АналитикаУчетаПоКонтрагентам
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО КлючиАналитикиУчетаПоКонтрагентам.Контрагент = ДоговорыКонтрагентов.Владелец
		|			И (НЕ ДоговорыКонтрагентов.ПометкаУдаления)
		|ГДЕ
		|	КлючиАналитикиУчетаПоКонтрагентам.Ссылка = &АналитикаУчетаПоКонтрагентам";
		Запрос.УстановитьПараметр("Дата"                        , Дата);
		Запрос.УстановитьПараметр("АналитикаУчетаПоКонтрагентам", АналитикаУчетаПоКонтрагентам);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если Выборка.ОплаченПолностью Тогда
			Движение                              = Движения.УП_СостоянияПроектов.Добавить();
			Движение.Период                       = Дата + 1; // увеличиваем на 1 секунду, чтобы это считалось как другая запись
			Движение.АналитикаУчетаПоКонтрагентам = АналитикаУчетаПоКонтрагентам;
			Движение.Состояние                    = Перечисления.СостоянияПроектов.Закрыт;
		КонецЕсли;
		
		Движение                              = Движения.УП_РасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения                  = ВидДвиженияНакопления.Приход;
		Движение.Период                       = Дата;
		Движение.АналитикаУчетаПоКонтрагентам = АналитикаУчетаПоКонтрагентам;
		Движение.Валюта                       = ТекСтрокаПроекты.Валюта;
		// пока берем сумму для долга из табличной части документа
		Движение.Сумма                        = ТекСтрокаПроекты.Сумма;
		
		ОбщиеСведенияПоПроектам = РегистрыСведений.УП_ОбщиеСведенияПоПроектам.ПолучитьПоследнее(Дата, Новый Структура("АналитикаУчетаПоКонтрагентам", АналитикаУчетаПоКонтрагентам));
		
		Движение                                   = Движения.УП_ОбщиеСведенияПоПроектам.Добавить();
		Движение.Период                            = Дата;
		Движение.АналитикаУчетаПоКонтрагентам      = АналитикаУчетаПоКонтрагентам;
		Движение.РуководительПроекта               = ОбщиеСведенияПоПроектам.РуководительПроекта;
		Движение.ВыполнитьДо                       = ОбщиеСведенияПоПроектам.ВыполнитьДо;
		Движение.ДатаПолученияАктаВыполненныхРабот = ДатаПолученияАктаОтЗаказчика;
	КонецЦикла;
	
	Движения.УП_ИсполнителиПроектов_Факт.Записывать = Истина;
	Движения.УП_РасчетыСИсполнителями.Записывать = Истина;
	Движения.УП_СостоянияПроектовИсполнителей.Записывать = Истина;
	Для Каждого ТекСтрокаИсполнители Из Исполнители Цикл
		ПараметрыАналитики = Новый Структура();
		ПараметрыАналитики.Вставить("Контрагент", Контрагент);
		ПараметрыАналитики.Вставить("Клиент"    , ТекСтрокаИсполнители.Клиент);
		ПараметрыАналитики.Вставить("Проект"    , ТекСтрокаИсполнители.Проект);
		АналитикаУчетаПоКонтрагентам = УП_РаботаСДокументамиСервер.ЗначениеКлючаАналитики(ПараметрыАналитики);
		
		Движение = Движения.УП_ИсполнителиПроектов_Факт.Добавить();
		Движение.АналитикаУчетаПоКонтрагентам = АналитикаУчетаПоКонтрагентам;
		Движение.Исполнитель                  = ТекСтрокаИсполнители.Исполнитель;
		Движение.ВремяВыполнения              = УП_ОбщегоНазначения_Сервер.ПреобразоватьВремя(ТекСтрокаИсполнители.ВремяВыполнения);
		Движение.Сумма                        = ТекСтрокаИсполнители.Сумма;
		
		Движение                              = Движения.УП_РасчетыСИсполнителями.Добавить();
		Движение.ВидДвижения                  = ВидДвиженияНакопления.Приход;
		Движение.Период                       = Дата;
		Движение.АналитикаУчетаПоКонтрагентам = АналитикаУчетаПоКонтрагентам;
		Движение.Исполнитель                  = ТекСтрокаИсполнители.Исполнитель;
		Движение.Сумма                        = ТекСтрокаИсполнители.Сумма;
		
		Движение                              = Движения.УП_СостоянияПроектовИсполнителей.Добавить();
		Движение.Период                       = Дата;
		Движение.Исполнитель                  = ТекСтрокаИсполнители.Исполнитель;
		Движение.АналитикаУчетаПоКонтрагентам = АналитикаУчетаПоКонтрагентам;
		Движение.Состояние                    = Перечисления.СостоянияПроектов.Выполнен;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КлючиАналитикиУчетаПоКонтрагентам.Ссылка КАК АналитикаУчетаПоКонтрагентам,
		|	ЕСТЬNULL(УП_РасчетыСИсполнителямиОстатки.СуммаОстаток, 0) КАК ДолгКонтрагента,
		|	ЕСТЬNULL(УП_ИсполнителиПроектов.Сумма, 0) КАК СтоимостьПроектаПоПлану,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УП_ИсполнителиПроектов.Сумма, 0) <> 0
		|			ТОГДА ВЫБОР
		|					КОГДА УП_ИсполнителиПроектов.Сумма <= ВЫБОР
		|							КОГДА ЕСТЬNULL(УП_РасчетыСИсполнителямиОстатки.СуммаОстаток, 0) < 0
		|								ТОГДА ЕСТЬNULL(УП_РасчетыСИсполнителямиОстатки.СуммаОстаток, 0) * -1
		|							ИНАЧЕ ЕСТЬNULL(УП_РасчетыСИсполнителямиОстатки.СуммаОстаток, 0)
		|						КОНЕЦ
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОплаченПолностью
		|ИЗ
		|	Справочник.КлючиАналитикиУчетаПоКонтрагентам КАК КлючиАналитикиУчетаПоКонтрагентам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УП_РасчетыСИсполнителями.Остатки(
		|				&Дата,
		|				АналитикаУчетаПоКонтрагентам = &АналитикаУчетаПоКонтрагентам
		|					И Исполнитель = &Исполнитель) КАК УП_РасчетыСИсполнителямиОстатки
		|		ПО КлючиАналитикиУчетаПоКонтрагентам.Ссылка = УП_РасчетыСИсполнителямиОстатки.АналитикаУчетаПоКонтрагентам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УП_ИсполнителиПроектов КАК УП_ИсполнителиПроектов
		|		ПО КлючиАналитикиУчетаПоКонтрагентам.Ссылка = УП_ИсполнителиПроектов.АналитикаУчетаПоКонтрагентам
		|			И (УП_ИсполнителиПроектов.Исполнитель = &Исполнитель)
		|ГДЕ
		|	КлючиАналитикиУчетаПоКонтрагентам.Ссылка = &АналитикаУчетаПоКонтрагентам";
		Запрос.УстановитьПараметр("Дата"                        , Дата);
		Запрос.УстановитьПараметр("АналитикаУчетаПоКонтрагентам", АналитикаУчетаПоКонтрагентам);
		Запрос.УстановитьПараметр("Исполнитель"                 , ТекСтрокаИсполнители.Исполнитель);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если Выборка.ОплаченПолностью Тогда
			Движение                              = Движения.УП_СостоянияПроектов.Добавить();
			Движение.Период                       = Дата + 1; // увеличиваем на 1 секунду, чтобы это считалось как другая запись
			Движение.Исполнитель                  = ТекСтрокаИсполнители.Исполнитель;
			Движение.АналитикаУчетаПоКонтрагентам = АналитикаУчетаПоКонтрагентам;
			Движение.Состояние                    = Перечисления.СостоянияПроектов.Закрыт;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
